{
  "data": [
    {
      "page_id": "362774807070711",
      "post_id": "1821919317822912",
      "picture": "https://scontent.xx.fbcdn.net/v/t1.0-0/p180x540/19657376_1821912707823573_5320547660500712766_n.jpg?oh=bf0e8bd85cfb3c630bd678722ecd7dc5&oe=59FDCD94",
      "created_time": "2017-07-04T15:16:54+0000",
      "type": "photo",
      "comments": [
        "Thank you thank you! Everyone have a very happy and safe fourth! If you must drink please have  a designated driver or calling Uber cab! You're not only putting your life in danger but everyone else on the road so please be smart!!",
        "Having a great day eating getting talking s.... Listing to music. If you have being drinking, don't drive, it's better to be safe then sorry. Have a great and safe day.",
        "Thank you very much  D D C for the free chips. Happy 4 of July to everyone there.  In my country, Argentina  INDEPENDENCE day  is  9 of july. Wish you a great day and enjoy the fireworks. 😍",
        "Happy 4th of July Every one Every where my wish is that Everyone,Everywhere have  Heathy Day and enjoy the fireworks. And Thanks DDC Team for the free chips, I'm full of BBQ at Pototo salad, really to spin and win. Thanks again DDC Team",
        "Love getting free chips, Thank you and all of you have a Happy July 4th.",
        "HAPPY 4th OF jULY TO EVERYONE  AND THANK YOU DDC FOR THE FREE COINS ....!!!!!",
        "Happy 4th to all DDC staff and their families..thx for the chips.:)",
        "Thank You DDC For The Free CHips,  Will Play again later today.",
        "Thank you double down I needed these. Points happy Fourth of July the greatest country in the world",
        "Thanks for free chips DDC.  Very much appreciated !  Have a safe,  fun & Happy Fourth of July everyone !",
        "Congratulation so much with the 4th of July! Love from Norway",
        "Have a happy and safe 4th!!  Thank you very much for the chips!!",
        "Happy Fourth of July to everyone and their family and be safe. Don't forget fly their Flags",
        "Thank you! Happy 4th of July!   Please stay safe...God Bless America!",
        "Happy 4th of July  to everyone from Dixie, Wa.  Thank you Double Down for the chips.",
        "The 4th of July is a great holiday\nTo spend with Family and have a great day.",
        "Are you guys playing guitar and banjos for the rafters ?  :  )",
        "Thanks for the free coins! Happy 4th of July everyone!",
        "Thanks for the free chips on celebrating Happy 4th of July Fireworks!",
        "Thank you for the coins and happy 4th of July - enjoy!",
        "Happy 4th to every one at Ddc ! Have so much playing all your games ! Thank you for all the freebies 🇱🇷🇱🇷",
        "Thanks for the free coins and happy 4th of July to everyone at DoubleDown Casino",
        "Thank you for chips\nHappy 4th of July \nBe safe and enjoy your day.",
        "Thank you D DC for the grate day for games..and free chips.",
        "En español por que tanvien los latinos selebramos el cuatro de julio feliz dia de 4 of July, y viva la independencia,",
        "Thank you so much -- really appreciate all the free chips you give us!",
        "Thank you for the free chips DoubleDown! And a very Happy and Blessed Forth of July to all of you!! ❤❤❤👍👍",
        "Thanks for the free chips. Have a bang up 4th, but stay safe.",
        "Thank you for the free chips, had fun while the lasted. Have a great Happy Forth of July. ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️😇🙏🇺🇸",
        "I want everyone to have a great  4th and remember why we celebrate it.  Let freedom ring.",
        "Thank God we live in this country  celebrate  our freedom, oai85",
        "Thanks DDC for free chips enjoy the 4th of July, everyone be safe 💥💥❤️🎉",
        "Thank you I needed some coins and have a happy and safe 4th.",
        "Hope everyone had a fun, safe and happy fourth! Thanks DDC for the chips!",
        "Thanks for all the codes. Double down is best casino app. Hands down",
        "Thank you for free chips.",
        "Thanks",
        "",
        "Thanks!😍👍😍👍",
        "",
        "",
        "",
        "",
        "",
        "thank you!!!!",
        "",
        "",
        "",
        "",
        "",
        "",
        "Thank You for the free coins!!!",
        "Thank you.",
        "Thank you.",
        "",
        "",
        "Ty DDC",
        "",
        "",
        "Happy Fourth Of July Have A Nice Tuesday Night From Jamie On FaceBook Bye",
        "Thanks for the chips!",
        "Thank you",
        "Thank you for the free chips. Happy 4th!",
        "Thank you!!!!",
        "tysvm ddc Happy fourth  EVERYONE win big LOL",
        "",
        "thanks",
        "Thanks  DDC",
        "merci",
        "",
        "Thanks for the coins",
        "",
        "",
        "Ty🇺🇸🇺🇸",
        "Thanks",
        "Thank you much",
        "",
        "Thanks!",
        "Thank you appreciated",
        "Thanks.",
        "Thanks DDC!",
        "",
        "Thank you !",
        "Thanks",
        "Thanks",
        "Thanks",
        "",
        "Ty 4 the chips",
        "Thank you for the chips, great sale also!",
        "Thank you for the coins",
        "Ty DDC so much for the free chips",
        "Ty so much for chips",
        "Happy 4th to you DDC and thank you for the coins.",
        "Birthday blessings Chuck! God bless you!🎈",
        "TY :)",
        "THANK YOU DDC,HAPPY 4TH. :)",
        "Thank you.i",
        "Cahlf",
        "Thank you.....happy 4th of July.",
        "merci",
        "",
        "",
        "Thank you, Happy 4th of July everone.🎊🎉🎇🎆",
        "HAPPY 4TH OF JULY DDC, THANKS FOR THE CHIPS",
        "thks  happy 4th of july",
        "Thank you!",
        "tHANKS!",
        "Thanks for codes and games are fun",
        "Thank you.",
        "Amen Amen and Amen"
      ],
      "totals": {
        "post_negative_feedback": 5216,
        "post_fan_reach": 1906273,
        "post_impressions_unique": 1988746,
        "like": 13876,
        "love": 539,
        "wow": 88,
        "haha": 30,
        "sorry": 15,
        "anger": 10,
        "comments": 925,
        "shares": 1962,
        "reactions": 14553
      },
      "score": {
        "shares": 16.241721854305,
        "reactions": 100,
        "comments": 73.1807,
        "timeAlive": 29,
        "negFeedbackAmount": 5216,
        "total": 62.509399211921
      }
    },
    {
      "page_id": "362774807070711",
      "post_id": "1830880573593453",
      "picture": "",
      "created_time": "2017-07-16T15:00:00+0000",
      "type": "status",
      "comments": [
        "Thanks DDC for the free chips - Is to cold outside, so Iam planning state home  all day  having fun with your games and once in a while a coffee.😊☺️☺️",
        "Had 3 cups.  Glad that scientists have proven that coffee is good for you...the more you drink, the more benefit to your heart and liver.  I knew God gave it to us for a reason!",
        "Usually have to wait and get my coffee when I get to Sunday School(they provide free) then have another cup when get home from church. Thanks for the free chips DDC, always appreciated, have a blessed evening!",
        "Thank God for coffee!  Thank you for the free chips, although today this is my morning.  I should have turned on the air conditioning yesterday and didn't so am paying for it today.  Feeling beter now though.",
        "Doing my usual playing the games I love, but low on chips though but its ok I'll wait it out check in a hour or so for the freebies and try to win more! Thanks for the fun fun fun!!!",
        "Love my coffee and once again thanks for the free chips. Please get the slot lucky lemmings. Will keep pestering you! Ha!!!",
        "I have enjoyed my second cup of tea and I will enjoy the free coins. TY",
        "Been drinking tea all morning..... Thanks guys for the chips. Always mean a lot to me. Love ya",
        "Thanks DDC for free chips just got home from church and ready to play for big wins, have a blessed day",
        "Thanks for Giving DDC Appreciate all you give love playing all all your game's So much Fun Love Love Love love playing ! Been so Unluckythe past 3 days !",
        "Thanks for the free coins and I'm just having my first cup of coffee",
        "No Coffee as Yet but will have one soon. Thank You DDC For The Free Chips.",
        "Been drinking tea all this  morning and afternoon ty dcc for the chips very appreciated",
        "Love these Sunday morning, coffee and newspaper, then gardening   ty for the freebie",
        "Thank you DDC for more free chips I am having my 2nd cup of coffee and playing DDC.",
        "OVERSLEPT ! 😮 Oh well, D,D, comes 1st with coffee, patience people!!😉",
        "Thanks DDC for the free chips! Had 2 cups of Tea this morning!",
        "Had 2 cups this morning ! Thank you for the free chips!",
        "Hangover this morning......LOL.......I had 4 cups of coffee and two ibuprofen.  :)",
        "LOL!  You just reminded me that my second cup is still sitting in the microwave for a reheat!!  Must Go Get NOW!!!  ;)",
        "Thank you. Could you keep them coming cause I Deffentely need them!",
        "It is now 6.30 in Perth OZ had my first cup of coffee:",
        "Thank you DDC for the free coins,  much appreciated.",
        "Heck I am on my second pot of coffee, and it is only4 PM. The night is still yound",
        "Sorry, don't drink coffee. Thx so much for the free chips.",
        "Thanks for the free chips it's one of the many reasons why I love DDC",
        "We 🇨🇦's love our Timmy's.....two cups just isn't enough. Thanks DDC, for the freebies.",
        "I drink coffee constantly lol I call it the Nectar of the Gods, hahahaha",
        "Thanks DDC for the many chips, I can use all I can get, enjoy the many games you offer.",
        "Second cups are always better, thanks for the chips",
        "Thanks for the free chips. Had good time playing today.",
        "Thanks DDC for the free chips! Still on my first cup, but will enjoy while playing DDC. Have a blessed Sunday!",
        "Thank you fur the chips !! If you had open the vault I d play that also 😃😃",
        "i'm in the 3+++ crowd.   Unfortunately, I drink coffee any time of the day.",
        "Ty for chips...coffee and I don't agree.....but had my tea...lol",
        "Always have a few cups in the morning! Thank you for the chips.",
        "How about 3, love my coffee, thanks for the chips DDC you're awesome!",
        "Thanks doubledown for the points, keep up the great job",
        "ty 3<",
        "OOPs..Forgot..On my third cup.. Started at 6am.. gotta have it!!",
        "Thanks DDC for the free chips.. Keep them coming..Love the games..😲😲",
        "Thanks for all the free chips. Love your games.thanks again.",
        "Had 2 cups of coffee be home staying out of the heat enjoying the free coins thank you",
        "Thanks for free chips.Your are my best casino to play. I get lucky when I play your games. Thanks Again",
        "Two cups of coffee. Cheerios, blueberries, strawberries and a banana with milk of course. Yummmy. Thanks for the chips.",
        "dankeschön für die free cpips, werde jetzt mal ein paar tage sammeln",
        "Do not drink coffee but am awake. Lol. Thanks and Good Morning.",
        "❤️\n💋💋Oh, yes I am in the crowd ! Thank you for the amount 😊of chips !! Have a great afternoon ! ❤️❤️🇺🇸",
        "",
        "Thanks",
        "DDC. THANKS FOR FREE CHIPS.",
        "",
        "Thanks for free chips DDC.  Very much appreciated !",
        "Thank you much",
        "Thanks for the chips DDC",
        "",
        "Yep, there already.  Thanks DDC .",
        "Thank  you",
        "tyvm.",
        "Thanks!!",
        "Thank you! Love free chips!! \nEnjoy your day",
        "Coffee 3plus",
        "",
        "likegame",
        "Thank you.....",
        "THANK YOU",
        "Thanks DDC!",
        "Thank you very much for the chips!!",
        "TY :)",
        "Thanks",
        "wow!!  thanks so much!!",
        "Thanks",
        "Thanks.",
        "",
        "thank you",
        "Thanks for the free chips.",
        "Ty 4 the chips",
        "thank you",
        "Thank you!!!",
        "Thanks for codes and games are fun",
        "Thank you",
        "Thanks",
        "thank you",
        "Thanks 😇❣️😇",
        "Don't drink either but thank you.",
        "Thank   You",
        "Obrigada DDC!",
        "Thank you!",
        "Heading for my 4th lol",
        "El mejor casino",
        "Thank you for the coins",
        "Thanks",
        "ty guys. Second cup of green tea.",
        "So thankful 😍",
        "thank you",
        "Thank you DDC enjoying my tea and games",
        "Thank you!",
        "Thank you",
        "Thank you so much for the chips DDC 😃",
        "",
        "Thank you",
        "merci",
        "Thanks DDC",
        "Thanks for the chips.  Only 2 cups of coffee.",
        "",
        "Thanks.",
        "Thanks again :)!",
        "Thanks for the free chips",
        "",
        "Thanks"
      ],
      "totals": {
        "post_negative_feedback": 5080,
        "post_fan_reach": 829566,
        "post_impressions_unique": 911921,
        "like": 12713,
        "love": 748,
        "wow": 44,
        "haha": 47,
        "sorry": 8,
        "anger": 10,
        "comments": 858,
        "shares": 1594,
        "reactions": 13567
      },
      "score": {
        "shares": 13.195364238411,
        "reactions": 93.224764653336,
        "comments": 0,
        "timeAlive": 17,
        "negFeedbackAmount": 5080,
        "total": 35.118642534276
      }
    },
    {
      "page_id": "362774807070711",
      "post_id": "1850233481658162",
      "picture": "",
      "created_time": "2017-08-01T15:00:00+0000",
      "type": "status",
      "comments": [
        "At 2:00pm it was over 6500 shares but no chips at 4pm and still not posted , is there a reason?",
        "Look at all these shares -- 2:53PM EST 8,444 Shares!! WhaHoo! We have done great --- maybe we will even get an extra reward!",
        "Thank you so much DDC Greatly appreciated 😊 your the best and only game I play you guy's make it so fun !!!,and I will be sharing,sharing,@ Sharing 😊😊",
        "I absolutely LOVE the new Double Diamond Slot!!! Have not seen that slot game in very very long time!!!  So much fun to spin and watch those diamonds to see which way they will fall!!  Up or Down!!!",
        "At least double down gives out a lot of chips the other two that I play Don't Give A very many",
        "Thanks DDC for free chips, everyone please share we need the extra chips have a blessed day 👍🏾❤️🎉😊",
        "YOU ARE THE ONLY SLOT GAME I PLAY.THANK YOU DDC FOR THE CHIPS. :)",
        "Thanks DDC for the chips, I'm going to share! Hope we can get the half a mil!",
        "Thanks DDC.  Love to play your games and really appreciate the free chips",
        "Thanks for the chips, had to get my chips back that I spent on that new diamond bump game.",
        "Thanks guys for free chips, love y'all as much as before......have a nice week",
        "yay 500K coins are coming our way in a few minutes . ThANK YOU Double Down.",
        "DDC is the funniest game to play ,Thank you DDC greatly appreciate you guy's.😊😊",
        "Great games you have, i been playing here and enjoying for a very long time I hope I win!!!!",
        "Thank you so much for the chips. Love the games, esp Cleopatra and Kitty Glitter",
        "Appreciate all you give love playing all all your game's So much Fun Love Love Love love playing all!💚💙❤",
        "Thank you very much for more free chips, I will share this post right now.",
        "Thanks for the free chips . You keep me in the game when I'm out! Really appreciate it",
        "Thanks for the many games and the free chips for those who just can't purchase right now.",
        "Thanks so much DDC!  Love the times you give us extras!  Keeps us all coming back.",
        "Thanks for the chips and I've sent my post out already!",
        "have have been playing this game for a long time. have enjoyed playing it. thank you for giving the  chips👩",
        "Let's get going guys and get this post for half a million by 4:01pm!",
        "We did it!!!  Waiting for our half a million  WOW 9,373 shares!!!",
        "Thanks shared let's go people a half of  million fishing Bob",
        "We will make it. Good luck. Thanks for being so generous. Good day.",
        "Thank you so much DDC Greatly appreciated 😊 your the best and only game I play you guy's make it so fun !!!,and I will be sharing,sharing,@ Sharing 😊😊",
        "thank you... I'm down so many chiips I need them...",
        "LOVE THOSE EXTRA FREE CHIPS DDC. THANKS.",
        "Thanks",
        "THANK YOU FOR A NEW. INFO. DDC. AND FOR FREE CHIPS.",
        "Thanks, shared!",
        "Thank you,",
        "TY DDC.",
        "Thank you for Free chips",
        "Gracias ddc",
        "",
        "",
        "Thanks DDC!",
        "",
        "Thanks for the coins.",
        "Thanks LOVE DDC 💗",
        "",
        "Shared thanks",
        "Thanks DDC love the game and the free chips",
        "Thank you much",
        "merci",
        "Thanks",
        "Thanks   DDC",
        "Thank you!",
        "THANKS",
        "Jason, Thank you so much for the Free Chips!!",
        "Thank you very much for the chips!!",
        "Thank you!!",
        "tank you",
        "come on everyone we are getting,close, share please.",
        "Thank you so much!",
        "",
        "Thanks,a lot.",
        "Ty DDC",
        "Thanks",
        "Thank you for the coins",
        "thank you",
        "TY :)",
        "TY :)",
        "Thank you!!!",
        "",
        "Thanks DDC",
        "Thanks for codes and games are fun",
        "merci",
        "",
        "",
        "Thank   You",
        "Thanks for the Free Chips & Shared by mee to help 😊",
        "Love your games thanks for the free chips",
        "Thank you!",
        "",
        "",
        "Thanks",
        "THANKRS FOR ALL THE HELP   GOOD MONING",
        "",
        "thank you",
        "Thank you for the chips much appreciated",
        "Thank you DDC~!!!",
        "Thank you so much......xxxxx",
        "Thanks",
        "Thank you...",
        "Obrigada DDC!",
        "Thanks",
        "",
        "Thanks DDC. DDC is the best.",
        "Thanks for the free coins",
        "Ty 😊❤️😊❤️😊😊😊",
        "7,403 shares by 11 AM Pacific Time!  :)",
        "Thanks so much for the chips DDC💕",
        "",
        "love the cntests and hope this is successful ... Sharing!",
        "Thank you!",
        "Thanks DDC you're awesome!👍💖",
        "thanks",
        "Ty ,should be a piece of cake",
        "Thank you!",
        "Thank you",
        "Thank u for the coins.",
        "",
        "",
        "Thanks again :)!",
        "Thank you"
      ],
      "totals": {
        "post_negative_feedback": 4872,
        "post_fan_reach": 944053,
        "post_impressions_unique": 1307264,
        "like": 12635,
        "love": 473,
        "wow": 68,
        "haha": 32,
        "sorry": 6,
        "anger": 7,
        "comments": 1232,
        "shares": 12080,
        "reactions": 13217
      },
      "score": {
        "shares": 100,
        "reactions": 90.819762248334,
        "comments": 70.8557,
        "timeAlive": 1,
        "negFeedbackAmount": 4872,
        "total": 86.35290254195
      }
    },
    {
      "page_id": "362774807070711",
      "post_id": "1851386394876204",
      "picture": "https://scontent.xx.fbcdn.net/v/t1.0-0/p180x540/20294433_1851384244876419_809048705137591706_n.jpg?oh=1f0b99024b0e84f7993592463c1d6c49&oe=59FA50E6",
      "created_time": "2017-07-29T00:00:00+0000",
      "type": "photo",
      "comments": [
        "DD Thank You soooooooo much for the free chips!!!  That is so awesome.  I've played your games for years and just talked to a relative about how you all never give away chips anymore.  What a wonderful surprise!!  Would love to win some more because I",
        "I loved it , fingers crossed that I might be one of the winners, I enter them all but haven't been lucky yet. I will continue to enjoy this game, either way,  thank you for this event ♡",
        "Loved playing my 3 favourite slots this week as well as the bingo.Absolutely love DoubleDown casino and thank you very much for the codes each day. Hope you send 300million chips to down in Australia. x x",
        "It has been amazing, I LOVE XMAS and almost counting down the days which is about 149 days Yippeeeeee, so live the Xmas spins from secret SANTA. Keep up the good work and I will try to be good. So Santa will visit me.",
        "was fun i play 7day,s a week anywhere from one hour to three hour,s depending if the game,s hitting lol if lose my coin,s i collect them for a few day,s so i can play longer lol keep it up team",
        "Thank you once again for the free coins they are really appreciated.  I have really enjoyed all the freebies  as they have  enabled me to play longer than normal.  Cheers.",
        "I enjoyed Christmas in July. I played a lot of different machines this week. Won on most of them. I hope I'm one of the winners tomorrow then I can up the ante and maybe hit a big jackpot!!!! Thanks ladies and gents for codes this week and everyday.",
        "I had loads of fun. Didn't too bad on the slots either. Love when you give us challenges. Thanks for the coins, and a Christmas in July.",
        "Thank you DD for all the free chips...had fun playing different slots and needed those extra chips so I could play three slots each day! Would enjoy seeing many more of these tournaments!",
        "I Love playing Thanks for all the Christmas chips in July it has been a lot of fun. . Thanks for this event DDC.....",
        "Well, I just about lost all my coins playing Spirit of Christmas but it was fun playing and seeing old Ebeneezer Scrooge again.  Hope to see him et al again at Christmas time.  Thanks for the free coins.",
        "Loved Christmas in July theme! I have played DD every day for 8 years. I have never won big and never have had the means to play for the jackpots. Would love to be able to....hope Santa is good to me !!",
        "Love this Christmas in July in Double Down Casino,Hope Santa will be nice to me and drop some chips my way please!I sure could need some about now if you look at my chip count.😢",
        "Thanks for Christmas in July. I usually just play the video poker and this week I stayed away from it and just played the slots. It was fun. I clicked all slots and just started from the first one and worked my way through all of them. I actually was able to win. Thanks so much for all the free coins.",
        "It had been fun, only wish you had brought back the other Santa game, this one is dark and unwelcoming. Thanks for prompting me to play a variety of games. I get stuck on my favorite and don't stray!!!!",
        "Awwwe  Sad it over I have had so much Fun this week made my Summer so fun fun! Thanks  for Giving DDC Appreciate all you give love playing all all your  game's! This was extra Special  to me! Thanks a million! ❤😍😍",
        "Well this is why I remain loyal to DDC, win or\nLose as o just came\nBack &10 mill due to LARRU THE LOBSTER AND DDC!' After a bit I'm going back to win back the\nRest. Thanks\nDdc for\nNever letting me down to zero'n😎",
        "Loved playing different games......thanks for the chips so I could play more than one.  I have some new favorites now.  Can't wait for the next giveaway from DDC.....you're totally awesome.",
        "Love Secret Santa in July week playing in DD casino games was awesome. I've been a loyal player with DoubleDown for many years, and never won a big one. DOUBLEDOWN ITS MY TIMEEEEE.❤️💟",
        "❤️💁🏻 Enjoyed it very much (however, I actually played awhile in all 3 Slots Games) 🤷🏻‍♀️ I wasn't aware you could just take a spin in each one BUT doesn't matter cause I had fun and actually went back and played 2 of the Christmas Themed Slots as well! GOOD LUCK 🍀 ALL & hopefully I have a shot for this contest 💁🏻",
        "Thanks for all the free give a ways I enjoyed getting them and I was able to play all time today 😁😁😁I hope that I am one of the big winners tomorrow, good luck DoubleDown Players 🙏🏾🙏🏾🙏🏾",
        "Thank you for the free chips!  Play my favorite games and others.  Today is my Birthday hope I am one of the winners.  It will be a nice Birthday present from DD to a faithful player!!!",
        "FUN, FUN, FUN.  J liked the 3 game , because if chips were short, you could most of the time play thru.  AND the chip amounts were super, anf frequent..helping me to keep playing.  Hooray for CHRISTMAS in JULY.!!!😍😍😍😍😍😊😊🤶",
        "Cuanto lo disfruté, que linda idea de santa claus para navidad en julio, jugué como lo hago siempre pero ahora con la ilusión de ser la próxima ganadora. Siempre participo espero ahora ser visitada por la santa suerte. Gracias Doubledown por tanta generosidad para todos los que participamos habitualmente.",
        "I really enjoyed playing Christmas in July, especially since I am at home with a bad case of shingles. Double Down Casino helps make my days happier.",
        "I did enjoy playing this week. I played a different game each time instead of my usual favorites. Believe it or not I won on alot of them. I still miss my favorite Monopoly! Thanks Secret Santa!",
        "thank you for all the codes i have enjoyed them so much keeping fingers crossed i get something out of it as i have used up all my credits  i love ddc as it is the best casino on the internet love yas",
        "I am finishing up cancer treatments and don't get to do much else right now, DD is my entertainment and escape. All the free coins have been very welcome! Thanks",
        "I definitely had a lot of fun enjoying Christmas in July. I especially enjoyed getting all those chips and being able to play more. Double Down is my favorite game on FB.",
        "I enjoyed it much,I been playing this game for so long in the last few years. I haven't won one yet ! Maybe this time I will be Lucky. Many thanks for Christmas in July.",
        "Have thoroughly enjoyed playing this week.  I miss it if I don't get to spend a certain amount of time on here each day.  It is my total relaxation, that and a cup of coffee.",
        "gracias gracias gracias , espero escuchen y lean mi mensaje ,. me encanta jugar a doubledown casino , me gusto mucho santa claus, espero ganar los 300 millones o algunos millones , por favor  ,. mil graciasssssssss❤️❤️❤️❤️❤️😘😘👌🎅🎅🎅🎅🎅🎅",
        "Merci pour tous les jetons que vous avez donnez pendant cette semaine. J' aime tous les jeux de votre casino, et, je suis un fervent adepte. Maintenant attendons de voir la liste des gagnants, cela serait génial si j' en faisait parti. Vous êtes une superbe équipe. Bonne journée à tous.",
        "Was a great time having extra chips to play with each day.  will certainly miss them since this is over.  would be nice to do a Christmas in August or perhaps a Thanksgiving in August with chips being allotted the same way.  Think about it please.",
        "thank you DD for all the free chips this week for playing SS in July.  It has given me the opportunity to play all the old and new games and I had fun doing it.",
        "Was fun being able to play Christmas games in July.Thank you DD for all the wonderful extra games you come up with.Never won a big jack pot hope I'm lucky this time.🎄💗",
        "Thank You Secret Santa it has been great seeing you every day. good luck to all who have been playing. \\thank you for todays free chips shall keep paying each and every day/",
        "This really was a fun week...got to try some slots I hadn't played in awhile...thank you!  Now I just need to be a winner 😃",
        "I don't know anyone who don't like presents. Thank you sooooo much for the free Christmas in July chips. Now I have enough to play with this weekend. 😍",
        "Thank you for all the free chips, Christmas in July would really be GREAT if I am one of the hundred to receive the big win!!!!!!!!! LOVE FREE CHIPS!!",
        "I have cookies and spiked eggnog  waiting for you, Santa.  All I want for July Christmas are those chips.  Santa KNOWS I give him much $$ during the year.  Ho ho ho!",
        "Thank you double down for all the fun and all the free chips be sure to come back with something else that was a lot of fun thank you very much will continue to play double down",
        "Was lots of fun, Christmas in July was a nice change, lost my rear playing the Ellen gamr but managed to ply almost all the rest.  Thanks DD for all the chips!!",
        "Lots of fun this week!  I like being forced out of my comfort zone to try other slots. Reminds me how much fun they can be.",
        "Gracias DDC, x la semana de regalos que hemos tenido!!, fueron muy bien venidos!!!, espero pronto vuelvan con otra tematica parecida!!. Muchas gracias!!",
        "Enjoy playingDDC Games.and all the free tokans. It would really make this 76yr ole Greatgrandmas day to finally win something.MAKE MY DAY<LOL",
        "I loved playing Christmas in July, every chance I had all week, I just wanted to keep playing, thank you Double Down, with triple the fun!!!!! I'll keep playing!!!",
        "I enjoyed playing the games this, lots of free chips that helped me play more. I love these games and DD is the best games I've ever played. Thank you so much and keep the contests coming. Love them!!!",
        "It truly was fun I love playing the slots so happy I found DD games on here, Thanks again for being sports and the free chips",
        "Had a blast playing your slots and now I have a chance to win a lot of chips to play more of my favorite game I spend hours a day playing thank you for making the best SLOTS!!!!!!!👍👍👍👎👎🤑🤑🤑🤑🤑",
        "Thanks for Secret Santa in July. It was such fun and I loved all the free coins. Keep up the good work. I love playing Double Down casino.",
        "Loved Christmas in July. Wish everyday was Christmas",
        "Since we retired to FL, we always celebrate Christmas when we come home in the summer.  That's when we have our own July giveaway!",
        "That was fun, thank you. Hope I entered the right way, fun anyway. I play everyday and run out of chips lol ,still the best games on the internet!!",
        "I enjoy the coins that you allow me to have it just make my day I love DoubleDown the best game ever if you can give me 100 millons coins I would be so greatful thank you.",
        "You are too good to us, thanks for all the free coins, so nice to receive - I never win tournaments but I am happy for who ever wins.",
        "Thank-you so very much for all your offers of the free credits, which allow players like me to really enjoy your game.  Thanks again  =D",
        "thank u so much for all the free chips  I love doubledown casino and play it every day  so much fun and love playing the new games too",
        "Thank you for a fun week.  I am an avid player, but you know that already.  I'd love to win the big one, but we will see.  Thanks again.",
        "Thanks for the 500k. Would be great to win something  big. Played 3 slots a day but lost lots. So its tome to win, win, win. Thanks again",
        "Thanks DDC for the Santa chips that you gave me. I never kept track of what the total was but I sure had had fun playing and winning . So thanks again !!!",
        "I really enjoyed this week Christmas in July and all the free chip giveaway  and also playing the three different games it was a lift a of fun Thanks DDC.",
        "Really enjoyed Christmas in July and all the free chips. Thanks for the free chips that you give. I can't afford to really buy chips so thanks again for the free chips",
        "Thank you for all the freecredits. It was alot of fun playing this week. Just got out of the hospital and recovering at home. Thanks again.",
        "Love DDC and love all the free chips.  I haven't had much luck even after purchasing chips so the free chips came in handy.  I am lost without DDC.",
        "Loved the Christmas in July!  Loved all the free chips.   It let me play.   I'm retired and can't afford to buy them no matter how much I want to.",
        "Thank you so much for all of the chips!  It was a special treat to have the Christmas in July and to have the contest as well!!  It has been an awesome week!",
        "felt a bit like Christmas was able to play for awhile and win pretty good. Thanks DD for the fun and opportunity to cash out BIG!",
        "Secret Santa was a lot of fun! Love Spirit of Christmas! Should keep it all year! Thanks for the free chips! Keep them coming!",
        "Secret santa , I want to thank you and everyone for being so generous this week . I e had lots of fun playing all my favorite games ! But glad it's almost over as my chips are getting mighty low !",
        "I liked the fact that  i was able to choose the games and it made the game that much more exiting .And you guys gave out a ton of chips !! Thanks.",
        "Ty Toni and DDC for all the fun with the Christmas in July theme. I had a Wonderful time playing all the Christmas games along with the regular ones. Thank You Again",
        "Me gustó mucho jugar a los diferentes tragamonedas para participar en el concurso. Pero  mi favorito  es La Corona de Egipto.",
        "HI LOVE playing and buying but disappointed that I didn't win ANYTHING since I have bought so much i n the last   5-6 wks --",
        "Nice surprise to play Christmas in July.  Better yet your giveaway surprise.  Love the site.  Thanks.👀 Looking for what games/surprises you guys come up with next!",
        "always enjoy collecting free points and love DoubleDown Casino - Free Slots!!!  my favorite... you can tell by my playing records..",
        "<3 !!! \n💋💋Thank you all ! It has been a blast playing December in July !! There was no snow to clean off the sidewalks. Left 🍪🍪and 🥛for the man in the Red Suit ! ❤️❤️🍷",
        "DDC thank you for all the coins you give us, I enjoy all of them, like I say some are magic and some are not and that is ok as they are free,for us old folks that can't afford to buy coins can still have some fun. Thank you in a Big Way for making me smile. Have a great nite.",
        "DDC I had fun and I enjoyed it I hope I win..I pray I win the 300 million please be nice to me DDC",
        "Thanks for the 500k! I win more from the FB posts than I do in the games :)",
        "ty  Loved Christmas in July.  Appreciate your generosity!",
        "I LOVE CHRISTMAS IN JULY...AND IT IS LESS EXPENSIVE THAN IN DECEMBER......",
        "Enjoyed Christmas in July. Thanks for the entertainment.",
        "Really enjoyed the theme  of  Christmas in July and  Secret  Santa thank you DoubleDown .",
        "Woohoo! I have loved Christmas in July!! Santa was so generous!! Thank you so much!",
        "Thanks Secret Santa for all the free chips!  Love Christmas in July!",
        "Christmas in July on Double Down....Doesn't get better than that",
        "Enjoyed Christmas in July, maybe we could have a summer in December ha",
        "Loved the DD  Christmas in July Promo... Hope Its My turn to be Lucky..  afterall Santa.. I've been a Real Good Boy all Year !!  Smile on Me !!",
        "I love Christmas in July. Secret Santa is awesome.  Love the Christmas theme games.",
        "Thanks DD for the half millions I enjoyed Christmas in July",
        "THANKS DDC! LOVED SECRET SANTA! SURE WILL MISS HIM! BUT BACK TO THE NORTH POLE TO PREPARE FOR THE KIDDIES! DREAMING OF COLD WEATHER AT THE NORTH POLE SINCE IT'S 95 DEGREES IN CAJUN COUNTRY!",
        "Love Christmas in July! Thanks for all the fun--and the chips!",
        "Thank you DDC. Don't win much. Play with what u give out.",
        "Thank you so much DDC it's been a fun week and Appreciate you so very much 😊😊",
        "I enjoyed the coins. Thank you so much. I love Double Diamond Casino even if I never win.",
        "Thanks DDC for the Half Million, I just Love the Secret Santa's Christmas in July, So don't forget the Milk and Cookies.",
        "THANKS FOR A FUN WEEK - I AM NOT A LUCKY PERSON HOWEVER THIS HAS ALLOWED ME TO PLAY DIFFERENT GAMES!! YOU MAKE IT AN INTERESTING CHALLENGE FOR A SENIOR CITIZEN!!!",
        "This was really great of you to do this. LOVED IT, THANK YOU!",
        "THANK YOU SO MUCH FOR THE FREE CHIPS!!!!!!!!!!!!!!!! I BEEN PLAYING FOR YEARS , YOU ARE THE ONLY GAME THAT GIVES THIS MUCH CHIPS, TRULEY APPRECIATED. I WOULD LOVE TO WIN 300 MILLION CHIS, IT WOULD BE AWESOME.",
        "This has been a fun event. The slots have been giving enough chips back to make playing fun.",
        "Thank you for a fun Christmas in July! I played some slots i normally don't play and enjoyed them!",
        "I sure hope I win. I have never won anything before. Thanks for the free chips.",
        "HOHOHO! !! I have checked my list twice and found DDC on the NICE side for all the fun you have given me!",
        "Thank you so very much for this week of fun!!!😊❤️❤️💋💋❤️❤️😊",
        "This made playing almost fun but we lost faster than we gained.",
        "it was fun, thank you.  much needed entertainment, even though it was just computer fun!",
        "I love DDC games always fun and I win and with your free chips keeps me playing. Thank you for all you do for me.",
        "I love doubledown slots. my favorite ❤️thanks for all the coins 😀😀😀😀",
        "Thanks for all the free chips!  Just in time to because lost them all yesterday to Scrooge!!  Have a great weekend! 🤗🦋"
      ],
      "totals": {
        "post_negative_feedback": 5720,
        "post_fan_reach": 917603,
        "post_impressions_unique": 1219804,
        "like": 12418,
        "love": 1196,
        "wow": 106,
        "haha": 27,
        "sorry": 6,
        "anger": 8,
        "comments": 2346,
        "shares": 2041,
        "reactions": 13757
      },
      "score": {
        "shares": 16.895695364238,
        "reactions": 94.53033738748,
        "comments": 71.4348,
        "timeAlive": 5,
        "negFeedbackAmount": 5720,
        "total": 60.344074808067
      }
    },
    {
      "page_id": "362774807070711",
      "post_id": "1830903616924482",
      "picture": "",
      "created_time": "2017-07-17T15:00:00+0000",
      "type": "status",
      "comments": [
        "Wow thank you very much, I feel lucky today maybe I should go to Vegas. Thanks again for the 500k. I'm be playing DoubleDown forever.\nIt's the very best o line casino. And IGT are the best in the real casinos. Again super thanks ❤️❤️❤️",
        "I won big time yesterday, first time ever winning over 100mil chips.",
        "Out standing, wonderful. Thanks guys y'all are the best. Love u all",
        "Thank you so very much DoubleDown.. you always take great care of us..",
        "Wow, you guys are awesome, I really appreciate it!!!!",
        "What a wonderful chip give away, love Double Down casino have for along time,  thanks",
        "you give so many the opportunity for fun that otherwise may not be possible.  thanx",
        "Thank you very much.  I was out of tokens and was having to wait until tomorrow to spin the wheel.",
        "Fantastic, thank you so much DDC! Great way to start my Monday for sure!",
        "Thank you very much for the generous amount of chips!!",
        "Thank you ,today is so cold I am finding it hard to get moving!!",
        "Thanks DDC you make Playing in your Casino So Much Fun. LOVE your Casinos",
        "Thank you for generous chip amount. I even got a 3M daily spin. 😊",
        "Thank you DDC, a great start for today! I'll be glad to share.",
        "Thanks for Giving DDC Appreciate all you give love playing all all your game's So much Fun Love Love Love!",
        "WOW,great way to get motivated ! Thanks very much ! 👍🏼😁",
        "Thank you for the chips.  Machines have not been paying lately so I needed the chips",
        "Thank You DDC For The Free Chips Much appreciated.jackpot is waiting for me./",
        "Thank you I was out this makes a good Monday morning 😀",
        "Thanks so much for the coins, really do appreciate it",
        "thank you for the chips, please put the transformer slot game back on, I think it is the most fun to play, thank you",
        "wow- need all the help I can get- thanks ever so much.:)",
        "Thank you very much for the free coins,  they are very much appreciated.",
        "thanks DoubleDown for all the chips today. love playing your games❤️❤️",
        "Love these surprise \"BIG\" flash spins. Love all of you for the chips everyday. Thank you.",
        "Happy Monday to everyone,and thanks for the chips we needed it.",
        "Thank you for the 500k.  Now I can play some of it and leave some for my hubby.",
        "Thanks DDC for the 500,000 chips! Needed them! Appreciate it!",
        "Merci beaucoup pour tous les jetons gratuits. Très Très apprécié.",
        "Thank you DDC for all the free chips. I enjoy playing foe fun, I do not bet very high.",
        "Thanks so much DDC for the free chips, I get so busy playing the games, I forget to tell you. ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️🌹🌹😇",
        "WOW......!!! You make Monday be better. Thanks for the special amount of free chips. Wish you a great day.  😍😍😍",
        "Thank you DDC for the free chips Jove playing your games!!!!!!",
        "Thank u DDC love playing all slots thank u for all the free chips that you give too us",
        "Thanks DAD 🚴🏌⛳🙋💛",
        "Thank you for the free chips greatly appreciated love double down casino",
        "thank you so much for the half a million free chips.Thank's again",
        "💋💋Triple Wow !! What a wonderful surprise!! Thank you for great amount of chips !! You all rock !! ❤️❤️",
        "",
        "thanks",
        "TYVM. 😃",
        "ty need them badly",
        "TY DDC",
        "Wow! thank you for all the chips.",
        "Thank you",
        "Thanks for the free chips DDC",
        "",
        "Gigi Angel Ana Drouet get them while you can",
        "1st a 1 million daily spin then this. Lovin my DDC",
        "",
        "Thanks DDC.  Great way to start a week.",
        "",
        "love this. ty.",
        "Thanks",
        "",
        "Thank you very much",
        "Thank  you",
        "Thank you so much!",
        "",
        "",
        "",
        "Great way to start,off a week.thank you.",
        "Thank you",
        "like game",
        "Thanks DDC appreciate it.",
        "",
        "Thank you so much for all these free chips!",
        "Thanks",
        "Thanks DDC!",
        "thank you much",
        "",
        "TY :)",
        "Thank you very much",
        "Thanks for the free chips.",
        "Thank You So Much! This does make Monday better! 😊",
        "Woo Hoo!!! Thanks for the chips DD :)",
        "merci",
        "thanks a lot",
        "",
        "Thanks DDC",
        "Thanks for your generosity   - really appreciated",
        "thank you so much xx",
        "thank you",
        "",
        "Thank you so much!",
        "thanks",
        "LOVE THOSE FREE CHIPS DDC. THANKS.",
        "Thank You 💗💗💗",
        "Thanks!  DD is my favorite!",
        "Obrigada DDC!",
        "Thank you",
        "Thanks for codes and games are fun",
        "Thank you.....",
        "Ty 4 the chips",
        "THANKS DDC",
        "",
        "Thank   You",
        "Thanks",
        "Thank you!!",
        "Thank you, I love the free credits.",
        "Like",
        "Fantastic.......Thanks"
      ],
      "totals": {
        "post_negative_feedback": 5189,
        "post_fan_reach": 886823,
        "post_impressions_unique": 1023022,
        "like": 12334,
        "love": 597,
        "wow": 151,
        "haha": 43,
        "sorry": 13,
        "anger": 10,
        "comments": 1161,
        "shares": 2763,
        "reactions": 13147
      },
      "score": {
        "shares": 22.872516556291,
        "reactions": 90.338761767333,
        "comments": 72.4332,
        "timeAlive": 16,
        "negFeedbackAmount": 5189,
        "total": 61.262677846796
      }
    },
    {
      "page_id": "362774807070711",
      "post_id": "1815880511760126",
      "picture": "",
      "created_time": "2017-07-09T15:00:00+0000",
      "type": "status",
      "comments": [
        "Only in the 90's here, and I love your post especially where I get 300,000 free chips. THANK YOU SO MUCH, Had to do an edit here, after playing and Winning this was so much fun, it is not fun when I have to take a break and have to quit playing due to my problems. Just LOVE playing the RED-WHITE-BLUE Sevens, THANK YOU SO MUCH FOR THE FUN.",
        "Like the heat better than the rain, but here in British Columbia we have a state of emergency with all the fires!!  its so sad today, will enjoy the free chips to play as its too smoky to go outside",
        "I love the warmer weather where the sun beams down & hot on your skin & i can be in my house cold enough for penguins to be comfortable while i'm curled in 2 quilts with only my head & one foot poked out! Ahhhh",
        "DoubleDown Casino - Free Slots,I'm in love with your new game!...I love wildlife,nature,the woods, I mean,those critters are adorable!!! And I love the sound effects(feels like you're right there in the forest)!",
        "Thanks so much DDC! I suffer from RSG which is a debilitating extremely painful disease mobility is very limited so this helps me pass the time and tried to take my mind off the pain! I love the games",
        "Is  a very cold raining day here, And we celebreite Independence day.  Is awful  outside, So I am waiting the raining stop , playing my favorites games. Thanks D D C for the free chips.😊",
        "We've been in the 90's with humidity almost as high with dew point right along up there.  Too muggy!!  Thanks for the chips DDC you're awesome",
        "Yes indeedy! 80/85% is perfect Im alergic to cold weather it is my worse enemy because I have arthritis everywhere so Im enjoying these warmer day's for sure.",
        "I hit love in error as I do love the warmer weather we've had the past several days. The cool cold weather is around more often then I care to think & all the rain has been miserable!!",
        "💖I'd rather it be cooler it's so humid and hot here !! Thanks for Giving DDC Appreciate all you give love playing all all your game's So much Fun Love Love Love!! 💖💘💜💗",
        "Living in Las Vegas with temperatures reaching 115 and the temperature inside your car at 138, I'd LOVE colder temperatures! 60-70 would work! Lol",
        "100's here in Utah, TO HOT.  Luckily spent a week in the high Uintas in 70 degree weather. Dreading going home to the heat.",
        "yes, yes, yes,  I LIVE IN SO. CAL IN WE HAVE BEEN IN THE MIDDLE OF AN \"HEATWAVE\" 100's FOR THE PAST 5 DAYS.  So, bring on the colder weather.",
        "its winter in australia but could do with spring weather getting sick of the cold",
        "Thank you DDC it's hot here in Arkansas but I'm not ready for winter",
        "Upper 90s here in Dallas with heat indexes in 100-110 range.  You gotta love Texas or get out.  😊",
        "107 degrees expected here today! Thanks for the chips!",
        "Too darn hot!! Give me cooler weather, fall is my favorite! Thanks for the free chips DDC! Love playing the games.",
        "well this is awkward as we are in middle of winter and want warmer weather can't stand being cold",
        "To hot for me in the hi 90s.not to use to this kind of weather in Peraluma ca.",
        "Thanks guys for the free chips. I enjoy every one I get. Y'all are fantisic people. Love  ya all............",
        "While we love Arizona, it's hard to \"enjoy\" 115-120 degree temps.   :-)   Thanks for the chips.",
        "Thanks, too hot outside so I spend more time playing DDC.",
        "Only while I'm here on vacay in Cancun but not back home in Houston!!",
        "I'll wait til tonight to use these, but thanks for the chips!! :)",
        "Love this hot sunny weather here in Sheerness ty dcc for the chips very much appreciated",
        "Not when it's 115 with humidity 🤔 Palm Springs, CA in the summer sucks 😃",
        "Like heat better then cold but have had a long hot-dry spell!",
        "Thanks DDC for free chips this weather is just fine with me ❤️👍🏾",
        "Thank you DDC for the coins, I like Fall temps. Rainy here today. Have a nice day.",
        "Love the summer it's Just Beautiful with blooming flowers green grass and Amazing Games to Play on DDC THANKS for FREE CHIPS !!!!",
        "Mahalo!  It's been in upper 80's here in Hawaii but thankfully we've had trade winds so it's been comfortable.  🌴🌴🌴",
        "Summer time rocks ! Hate cold weather , thank you for free chips , as ALWAYS !!!",
        "I like it colder 98 is to hot here in Missouri",
        "It's winter in Australia, but summer will be here soon enough :)",
        "Thanks for the extra chips, hot and humid in Alabama!",
        "Enjoying this summer weather in Minnesota!   Winter will come soon enough.",
        "Feel like is 102 here in sunny Florida  TY for the chips GREATLY appreciated.",
        "Here in the UP of Michigan we have enough cold weather.  It's finally getting into the 70's!!",
        "I hate humid hot days I live in MN CUZ it is cool most of the time",
        "I love the warm -- even hot summers.  I do not like the cold of winter.  Thanks for the chips and hope you enjoy your day😊",
        "Thanks DDC you are awesome I like fall not to cold not to hot and the beautiful colors the trees change",
        "Don't like HOT 105 to 110 and up here thanks DDC for the daily chips",
        "luv the summer and all it has to offer..to bad it doesn't last long enough.:)..thanks for the chips.:)",
        "Nothing better than beautiful warm summertime!!  Thank you very much for the coins!!",
        "Bring it on.....winter lasts too long in Wisconsin!!!!",
        "Beautiful here just the right temp sunny and slight breeze love it",
        "Ty for coins. In Florida,and rains every day now,but can't complain.",
        "Beautiful weather in New York- Sunny,low humidity and 82 degrees! Thanks DDC for the free chips!",
        "It's been in the mid to high 100* looking forward to cooler weather. As always, thanks for the chips😊",
        "Not liking 106.  Have to stay inside and play DDC. Thanks for the free chips.",
        "I don't mind the heat to much it is the humidity here in so cal the last couple days that is miserable to me.",
        "It's the humidity that I don't like.  Thank you for the 300,000 chips.",
        "Thank you for the chips!  Going to be in the mid 90's here today, it's a dry heat!",
        "In Louisiana ; weather in the 90's. thank You DoubleDown for 300,000 coins",
        "I live in the Pacific NW. The temp is perfect for summer fun! 67 degrees! Gotta love it!",
        "Love the warm weather just don't like the High humidity Thanks DDC for the free chips and fun games",
        "thank you",
        "Not really COLD temps - just 15-20 degrees cooler than our 90's",
        "Hot here in Dallas, then the rain comes in the afternoon. Muggy!! :( Appreciate the free chips!!! :)",
        "107 again today.  Too hot to go outside.  Keep cool by eating popsicles and playing DDWOF.",
        "The summer is great but I enjoy every season !\n💋💋Thank you for very extra amount of chips today ! ❤️❤️ Love them !!",
        "Thanks DDC Team for the Weather chips, it's very Hot weather wise, it's already 90', and that's hot, so thanks for the cool down",
        "DDC.  THANKS. FOR. FREE CHIPS.",
        "thanks",
        "Happy Sunday",
        "Thanks!",
        "Thanks",
        "Thank you.",
        "Thanks for the chips DDC",
        "Thanks",
        "thank you",
        "Thanks.",
        "",
        "Thank you very much",
        "thank you",
        "Thank you!",
        "",
        "Thank you!!!",
        "Thank   You",
        "Ty DDC",
        "Thanks So Very Much",
        "thanks",
        "Thank you",
        "Thanks for the chips\nIt's winter here in Aus",
        "Thank you for the coins",
        "Thanks for free chips DDC !",
        "thanks   DDC",
        "TY :)",
        "Thanks DDC!",
        "Thanks",
        "Thank you-warm and wonderful.",
        "Thanks",
        "Thanks for the free chips,",
        "",
        "Thank you!",
        "Ty 4 the chips",
        "thanks for the coins",
        "",
        "Thanks !",
        "thanks",
        "",
        "Thanks for the free chips!!💝💖",
        "merci",
        "Obrigada DDC!",
        "Summer is the best...should be a longer season!",
        "i live in az.so its hot.thank you",
        "merci",
        "Thank you!!",
        "I'm in Florida and it's too hot!!  Going to visit son in Montana!"
      ],
      "totals": {
        "post_negative_feedback": 5103,
        "post_fan_reach": 880091,
        "post_impressions_unique": 983712,
        "like": 12300,
        "love": 815,
        "wow": 37,
        "haha": 26,
        "sorry": 15,
        "anger": 4,
        "comments": 821,
        "shares": 1691,
        "reactions": 13196
      },
      "score": {
        "shares": 13.998344370861,
        "reactions": 90.675462104034,
        "comments": 0,
        "timeAlive": 24,
        "negFeedbackAmount": 5103,
        "total": 34.542356136715
      }
    },
    {
      "page_id": "362774807070711",
      "post_id": "1824637017551142",
      "picture": "https://scontent.xx.fbcdn.net/v/t1.0-0/p180x540/19702299_1824636187551225_4693431227546207477_n.jpg?oh=48f721c5df599bd8b8d2726dd3057eaf&oe=5A007AB4",
      "created_time": "2017-07-15T15:00:00+0000",
      "type": "photo",
      "comments": [
        "TY DDC it is like the desert in Fl.  Hot as it can get, so I am enjoying playing your games.",
        "Thanks DDC for free chips, no sunshine in Dallas today its storming so I'm playing DDC all day 👍🏾😊☔️❤",
        "Thanks DDC!! Love playing all all your game's So much Fun Love Love Love love playing!😍😍😍",
        "Thank you for the free chips and the continues fun I have playing your games.",
        "The games are a lot of fun. And just like going to any Casino .. Ya win some and ya loose some. Thanks for a good time !",
        "thank you for all the free chips I like playing double down v poker",
        "Thanks,awesome day, really enjoyed the games.",
        "Thanks DDC for giving me The opportunity to spin again.",
        "Thanks DDC for the free chips. Enjoy playing your games staying indoors after from the hot summer fun!💥👌👍🏻😍",
        "I Thank You From The Bottom Of My Heart❤️ For All The Free Chips You Give...🎉🎉🎉😄",
        "Thank you very much for the Free Chips Jason!!",
        "Thank you for the chips. Another hot day to say inside and play DDC",
        "Thank you for the the free chips. I play everyday and enjoy it. 😍😀",
        "Thanks DDC so much for the free chips, I enjoy all the games and you are the best. ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️👍🌹😇🇺🇸",
        "tks for the chips!!!!!!!!!!!!  another weekend another sale!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "Thanks for \nMy coins. Extra three times is even better!",
        "Thanks DDC for the free chips! Have a cool and blessed Saturday!",
        "THANKS YOU DDC. FOR FREE CHIPS.",
        "thanks",
        "Thanks for all the chips.",
        "Thanks DDC for the free chips! Very Warm in New York Today!",
        "",
        "Thanks for the free chips DDC",
        "THANKS",
        "Thanks for free chips DDC.  Very much appreciated !",
        "",
        "",
        "",
        "Thanks",
        "Thank you much",
        "Thank  you",
        "Thank you DDC.",
        "thanks",
        "thank you",
        "Easily the best games are on Doubledown!",
        "like game",
        "",
        "Thank you",
        "Ty...DDC enjoyed playing",
        "Thanks for the chips.",
        "Thank you very much for the chips!!",
        "",
        "Thanks",
        "Thanks DDC!",
        "Thx going to be 118 today...great cool down",
        "Thanks DDC for the free chips!",
        "",
        "merci",
        "Ty DDC",
        "TY :)",
        "thanks again..",
        "Thanks for the free chips.",
        "Thank you",
        "thank you",
        "thank you",
        "Thanks",
        "",
        "Thanks",
        "Thanks ❤️",
        "Thank   You",
        "Thank you for the coins",
        "Ty 4 the chips",
        "It's been awhile since I played this game!",
        "Thanks for codes and games are fun",
        "Thanks!!",
        "For Real ? Thank you !",
        "thank you appreciated",
        "",
        "Thank you for the coins",
        "Thank you, enjoy playing every day. Win some lose some.",
        "",
        "Thanks for the chips",
        "Thanks for the free chips.",
        "Jason, Thank you so much for the Free Chips!!",
        "",
        "Thanks for the free chips. Always appreciated!",
        "Thanks for the chips!",
        "Thanks!",
        "Appreciate the chips tyvm",
        "",
        "Thank you",
        "Thanks DDC",
        "Thanks",
        "Thank you so much",
        "thanks DDC",
        "Thanks",
        "Thanks double down casino",
        "Thank you",
        "Thank you very much",
        "Thanks ddc",
        "Thank you.",
        "Thanks for the free chips",
        "Thanks.",
        "Thanks",
        "Thank you!",
        "Thanks",
        "Thanks DDC. Love to play!",
        "merci",
        "Thank you DDC for the coins.",
        "Thank You!!!!",
        "Thank you!",
        "THANKS",
        "Thanks love DDC",
        "I want to. Play",
        "Thanks so much for the coins, do appreciate it",
        "Thank you!!!!",
        "Thank you DDC",
        "Thank you",
        "GRACIAS",
        "Thank you DDC!"
      ],
      "totals": {
        "post_negative_feedback": 5057,
        "post_fan_reach": 1418946,
        "post_impressions_unique": 1492875,
        "like": 12266,
        "love": 409,
        "wow": 29,
        "haha": 30,
        "sorry": 20,
        "anger": 22,
        "comments": 852,
        "shares": 1755,
        "reactions": 12773
      },
      "score": {
        "shares": 14.528145695364,
        "reactions": 87.768844911702,
        "comments": 73.6056,
        "timeAlive": 18,
        "negFeedbackAmount": 5057,
        "total": 58.047854900332
      }
    },
    {
      "page_id": "362774807070711",
      "post_id": "1838351839512993",
      "picture": "https://scontent.xx.fbcdn.net/v/t1.0-0/p180x540/19989317_1838351839512993_3583255770331553884_n.jpg?oh=b858c8bee2d12ee6c91f722cfa2a85b3&oe=5A2D13AA",
      "created_time": "2017-07-19T15:00:00+0000",
      "type": "photo",
      "comments": [
        "Thank you!!  I like the new Three Kings, and better yet, it likes me!😊",
        "Thanks for the free chips DDC, hope all of you have a great day. ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️😇🌹🌹",
        "This is one of my favorite Casino games.   But, I am not a favorite of theirs.....lol",
        "Thank you ! I love the free coins each day!  This is my favorite game of all!",
        "Thanks for the free chips you all have a great day",
        "Thanks for Giving DDC Appreciate all you give love playing all all your game's So much Fun Love Love Love!",
        "Thanks so much for the coins, appreciate it",
        "I missed you the last day and thanks for the coins..!",
        "Thanks DDC for all the free chips are we not getting any more chips today",
        "Thank you I will let you know which ones I like with all those coins !!!!",
        "Thanks  DDC for all the chips you give us  Wish all of you a great and blessed day.  😍😍😍",
        "I have missed you the last two days.  Thank you for the coins.",
        "Thanks DDC for free chips it's hot in Texas but I'm staying inside playing DDC have a blessed day 👍🏾❤️🎉",
        "💋💋Thank you very much !!  It is a HOT day here in Indiana ! Stay cool  wherever you are ❤️❤️",
        "Love this Casino and the free play provided!!",
        "Thank you very much for the chips!!",
        "thanks",
        "Thanks for codes and games are fun",
        "Thank you!!!",
        "Need to play the new one, thanks",
        "Thank you!",
        "Thanks for free chips DDC.",
        "",
        "POKER! YES!",
        "Thanks for free chips DDC.",
        "Thank you much",
        "",
        "Thank  you",
        "Thanks",
        "thank you",
        "THANKS DDC FOR THE EXTRA CHIPS. LOVE THEM.",
        "Thanks for the chips DDC",
        "thank you",
        "",
        "Thanks",
        "thanks",
        "Thanks",
        "",
        "Thanks DDC!",
        "Thanks for the free chips.",
        "Thank you DDC.",
        "thank you",
        "thank you",
        "like game",
        "TY :)",
        "Thanks 💗💗💗",
        "Thanks",
        "",
        "Thank you.....",
        "",
        "Thank you.",
        "Thanks for the free chips!",
        "Thanks.",
        "thanks",
        "Thanks for the chips.",
        "merci",
        "Thank you appreciated",
        "Ty DDC",
        "THANKS DDC",
        "Ty 4 the chips",
        "Jason, Thank you so much for the Free Chips!!",
        "",
        "Thank you!",
        "Thanks for the coins",
        "Thank you",
        "Thank you",
        "",
        "Thank you 😊",
        "merci",
        "Thanks for the free chips DDC!👍",
        "Thank you for the coins",
        "Thank you",
        "It is not here today, thanks double down!!",
        "Thank   you   !!!!!",
        "Thanks.",
        "Thank you double down for the free chips.",
        "Thanks for the free chips",
        "Thanks",
        "Thanks so much for the chips 💕",
        "Obrigada DDC!",
        "Thanks again :)!",
        "Thanks DDC",
        "Ty DDC",
        "Thanks",
        "Thank you.",
        "THANKS DDC. :)",
        "So thankful 😍",
        "Thanks for the free coins",
        "Thanks for the free chips DDC",
        "thank you",
        "Thanks for the coins",
        "Thank you it let me play for little bit!!",
        "Thank you DDC",
        "thanks very much.",
        "Thanks",
        "Thank you",
        "Thank you DDC!",
        "Thank you double down for the free chips",
        "You all are awesome!!💋💋💋",
        "Thank u",
        "Thanks",
        "Thanks for the free chips!",
        "Ty DD you're on fire",
        "Thanks",
        "Thank you DDC for the coins.",
        "Thanks for the free chips!!",
        "Thanks for the FREE CHIPS!",
        "TY  I NEED  CHIPS"
      ],
      "totals": {
        "post_negative_feedback": 5055,
        "post_fan_reach": 1278774,
        "post_impressions_unique": 1366294,
        "like": 12259,
        "love": 419,
        "wow": 37,
        "haha": 16,
        "sorry": 11,
        "anger": 10,
        "comments": 891,
        "shares": 1789,
        "reactions": 12748
      },
      "score": {
        "shares": 14.809602649007,
        "reactions": 87.59705902563,
        "comments": 77.8218,
        "timeAlive": 14,
        "negFeedbackAmount": 5055,
        "total": 59.47539235263
      }
    },
    {
      "page_id": "362774807070711",
      "post_id": "1840352455979598",
      "picture": "https://scontent.xx.fbcdn.net/v/t1.0-0/p180x540/20245875_1840352455979598_7653645653793084447_n.jpg?oh=879ff798f1574e06aa35d8da0a29e794&oe=59FE3E3B",
      "created_time": "2017-07-30T15:00:00+0000",
      "type": "photo",
      "comments": [
        "Thanks DDC for the free chips! It's been a rough couple of weeks for me at the slots, but still love your games. Thanks again and have a blessed Sunday!",
        "i really enjoyed for being a regular player of DDC... even in my breaktime at work i have to play for a while to remove my tiredness honestly i love it...keep it up more games...",
        "I love this casino. You provide an inexpensive service that gives us fun and excitement right on our own comfort of home. Thank u DDC for being the best!!$$$$$$",
        "Thanks but lost again. Oh well I sure miss Santa and I also miss being Flashed. Lol. That's ok you guys work hard just trying to keep us happy. And I am Happy that's it . Thanks love my DDC. 🍀🍀🍀🍀🍀👄👄",
        "Thank you DDC love your games, and a double thank you for the free chips. they   keep me going , Have  a great happy Sunday.",
        "Thanks for chips, if you could send some s'mores  it would be nice.",
        "I agree that luck hasn't been on my side this past week but this is my favorite site to play:) and please send smores free chips!!",
        "Thanks for free chips DDC.  Very much appreciated !  Love the S'MORE !",
        "Thank you so very much DDC i appreciate and needed those chips.",
        "Thanks for the chips, I love spending them",
        "Thanks for all the chips, it allows me to play a long time.",
        "Thanks for the chips DDC you're awesome as usual.  Have a great day!",
        "Thanks for the coins. They a re appreciated.",
        "Thanks for the flash code DDC Appreciate all you give love playing all all you give love playing all all your game's So much Fun Love Love Love love ❤💙💚",
        "WOW these coins came in handy. I was broke.and couldn't play.",
        "❤️💙THANK YOU DOUBLEDOWN CASINO FOR THE FREE CHIPS ❤️💙\nYOUR AWESOME!!!!!!!!👍👏👍👏👍",
        "Merci Double Down pour les coins gratuits ce jeu est super j adore mais on ne gagne rien avec les coins gratuits je vais cesser d y jouer  avec regret",
        "I enjoy playing DDC Hoping for the chips,T.Y.",
        "Thank You DDC For The Free Chips. Will keep playing each day. My Favorite SLOTS.",
        "ThanksDDC for all the chips Sunday night no late night free chips tonight's?",
        "TY.😣 wish i could take advantage of the sale, but i am broke until next month.",
        "Thank you DDC for the coins. Have a nice Sunday Evening.",
        "SMORES should have been the code lol",
        "This chocolate looks yummy",
        "Love chocolate and DDC😍",
        "I love marshmallows",
        "",
        "thanks",
        "",
        "Thanks you. D D C. For free chips.",
        "Gracias ddc 😍",
        "Thank you😚😉😘☺️😚",
        "",
        "THANKS",
        "Thanks DDC!",
        "",
        "",
        "Thanks DDC.  Sounds like fun loving hugs to everyone",
        "Thank you for the free chips.",
        "Thanks DDC For The Free Chips love playing your Slots",
        "thanks!",
        "Thank You !!!!! 🌸🌴🌸",
        "Thanks DDC.",
        "LOVE THOSE EXTRA CHIPS DDC. THANKS.",
        "Thank you much",
        "Thank you!",
        "Thanks DDC",
        "Thanks",
        "Thank you guys !",
        "thank you!!!",
        "Thanks",
        "Jason, Thank you so much for the Free Chips!!",
        "",
        "tank you",
        "",
        "Ty 4 the chips",
        "Thank you very much for the chips!!",
        "",
        "Thank you!",
        "ty happy sunday staff and happy spinning evryone else",
        "merci",
        "",
        "Thank you for the coins",
        "Thank you!!",
        "TY :)",
        "Ty DDC",
        "Do you still have Black Jack?",
        "Thanks for codes and games are fun",
        "Thank you.",
        "Thank you......",
        "",
        "Thank you.",
        "Thanks for all the free chips!",
        "",
        "Thank   You",
        "Thanks.",
        "Thanks",
        "Thanks",
        "Thanks DDC for the free chips.",
        "merci",
        "Thanks.",
        "Obrigada DDC!",
        "thank you",
        "Thanks DDC",
        "Ty DDC!!!💋💋💋",
        "",
        "",
        "thanks",
        "Thank you Double Down for the free chips 😀",
        "Thank you DDC.",
        "",
        "Thank You.",
        "thanks",
        "Thanks",
        "Thanks",
        "Thanx DDC 4 the free chipz",
        "Thank you DDC 😊 Greatly appreciated.",
        "TY DD",
        "Thanks for the free coins",
        "Thank you!",
        "Happy Sunday",
        "thanks",
        "going to play slots..",
        "Thanks",
        "Thank you DDC!",
        "Thank you",
        "Thanks for the chips DDC",
        "",
        "Thank you,",
        "Thx for the free chips much appreciated"
      ],
      "totals": {
        "post_negative_feedback": 5143,
        "post_fan_reach": 1403621,
        "post_impressions_unique": 1651198,
        "like": 12190,
        "love": 408,
        "wow": 49,
        "haha": 23,
        "sorry": 23,
        "anger": 15,
        "comments": 897,
        "shares": 1850,
        "reactions": 12702
      },
      "score": {
        "shares": 15.314569536424,
        "reactions": 87.280972995259,
        "comments": 71.5352,
        "timeAlive": 3,
        "negFeedbackAmount": 5143,
        "total": 57.463145035455
      }
    },
    {
      "page_id": "362774807070711",
      "post_id": "1824555724225938",
      "picture": "https://scontent.xx.fbcdn.net/v/t1.0-0/p180x540/19665481_1824554984226012_6308745422658591347_n.jpg?oh=0f7aee7de2d5a55998f829b65f6eba45&oe=5A3766C2",
      "created_time": "2017-07-10T15:00:00+0000",
      "type": "photo",
      "comments": [
        "Thanks for Giving DDC Appreciate all you give love playing all all your game's  ! I love all you game's! You make them so much fun to  play! Glad you put Double Diamond  back  on  there ! One of my very favorites! Thank you!,💜❤💙💚💛",
        "Rainy days and Monday's always get me down. Hit us up doubledown. Cheer us up some more. Love all y'all do. Thanks bunches😉",
        "Great way to enjoy a Monday with free chips from DDC, thanks a bunch!!",
        "My favorite & only game I play.  Thx for the free chips. Some higher daily give away would be nice.",
        "Thanks for the free chips. Also sorry I cannot afford to buy any at that great price.",
        "I love most of your games, especially when I get to win some.. TY DDC, you are the best & # 1.",
        "Thanks for all the chips fun and surprises every  day .💞♥️💞❤️",
        "Thank you very much for the free chips, really love DDC, \nTons of enjoyment.",
        "Thank you DDC for the chips.  Love playing most games in DDC.  So entertaining!!!",
        "Thank you DAD. I'm having a good run with some good wins. About time. Thanks",
        "Thank you for the chips. Another hot day to stay inside.",
        "Thanks so much DDC for the free chips enjoy your Monday 😊",
        "Thank you for the free chips love all the games keep me busy during the day",
        "Thanks",
        "DDC.   THANK YOU. FOR MY FREE CHIPS. GOOD DAY.",
        "thank you",
        "Thanks",
        "Thanks for free chips DDC.  Very much appreciated !",
        "",
        "Thanks 😍👍😍",
        "",
        "",
        "",
        "Thanks for the chips DDC",
        "",
        "",
        "",
        "Thank you very much",
        "Thank you!",
        "",
        "",
        "Ty DDC appreciate it",
        "thank you",
        "Thank you!!",
        "Thanks DDC.",
        "Thank you, maybe I will get some coins back",
        "thank you",
        "Thanks for the free chips!💝💖",
        "Thanks ❤️",
        "Thank you for the coins",
        "Thank you!",
        "Thanks DDC",
        "Thank you!",
        "",
        "Thanks for the free chips,",
        "Thanks again",
        "Thanks",
        "",
        "Thanks DDC!",
        "",
        "Thanks again 🤣🤑!",
        "merci",
        "LOVE..",
        "Thanks.",
        "thanks!",
        "Thanks 😙",
        "thank you much",
        "Obrigada",
        "thanks",
        "thanks",
        "",
        "Thanks for codes and games are fun",
        "",
        "Thanks.",
        "ty guys",
        "Thank you.",
        "Thanks.",
        "TY VERY MUCH !!! 💝",
        "Thanks",
        "Thank you very much for the free coins DDC. ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️😇🙏",
        "Thanks a lot",
        "TY for the chips",
        "Thanks",
        "Thank you!",
        "Thank you!",
        "tHANK YOU SO MUCH.",
        "So thankful 😍",
        "This is my game",
        "Thanks!!",
        "Thanks",
        "thank you",
        "",
        "Ty DDC!!!💋💋💋",
        "Thank you",
        "merci",
        "Thanks",
        "Thanks love triple diamond",
        "",
        "I forgot to say thanks i play it when i go to casino",
        "Thanks",
        "Jason, Thank you so much!!",
        "thanks for the chips",
        "Thank you so much appreciate it",
        "Yippie!",
        "Thank you for the chips",
        "Thank you for the free chips",
        "THANKS DDC.:)",
        "Thanks for the coins",
        "Thank you DDC for the coins.",
        "GRACIAS",
        "Thanks for the chips.",
        "Ty so much DDC",
        "like game",
        "Thank you DDC",
        "",
        "Thank you.",
        "Thank you",
        "Thank you DDC",
        "Thanks.",
        "Thank you."
      ],
      "totals": {
        "post_negative_feedback": 5222,
        "post_fan_reach": 1382759,
        "post_impressions_unique": 1462021,
        "like": 12056,
        "love": 398,
        "wow": 50,
        "haha": 19,
        "sorry": 22,
        "anger": 21,
        "comments": 814,
        "shares": 1833,
        "reactions": 12560
      },
      "score": {
        "shares": 15.173841059603,
        "reactions": 86.305229162372,
        "comments": 72.7174,
        "timeAlive": 23,
        "negFeedbackAmount": 5222,
        "total": 57.484835173252
      }
    }
  ]
}